/*=============================================================================
** 作者：侯玉鹏
** 日期：2017/10/31
** 版本：V1.0
** 函数名:
** 函数功能：
** 输入参数：
** 输出 ：1  返回值：
          2  改变的全局变量
** 本函数调用的其它函数（版本号）：
** 备注：
** 修改日志： （作者，日期，修改内容及原因）
==============================================================================*/
#ifndef _DEVICE_IIC_H
#define	_DEVICE_IIC_H

#include "stm32f10x.h"

/* IIC延时长短 */
extern volatile u8 I2C_FastMode;

/*----------------------------------------------------------
 + 实现功能：IIC设备初始化
----------------------------------------------------------*/
void Fc_I2c_Init(void);

/*----------------------------------------------------------
 + 实现功能：IIC写入单字节数据
 + 调用参数功能：设备，寄存器，数据
 + 返回参数功能：0正常 1异常
----------------------------------------------------------*/
extern u8 IIC_Write_1Byte(u8 SlaveAddress,u8 REG_Address,u8 REG_data);

/*----------------------------------------------------------
 + 实现功能：IIC读取单字节数据
 + 调用参数功能：设备，寄存器，数据
 + 返回参数功能：0正常 1异常
----------------------------------------------------------*/
extern u8 IIC_Read_1Byte(u8 SlaveAddress,u8 REG_Address,u8 *REG_data);

/*----------------------------------------------------------
 + 实现功能：IIC写入多字节数据
 + 调用参数功能：设备，寄存器，数据长度，数据
 + 返回参数功能：0正常 1异常
----------------------------------------------------------*/
extern u8 IIC_Write_nByte(u8 SlaveAddress, u8 REG_Address, u8 len, u8 *buf);

/*----------------------------------------------------------
 + 实现功能：IIC读取多字节数据
 + 调用参数功能：设备，寄存器，数据长度，数据
 + 返回参数功能：0正常 1异常
----------------------------------------------------------*/
extern u8 IIC_Read_nByte(u8 SlaveAddress, u8 REG_Address, u8 len, u8 *buf);

#endif
/* ©2015-2016 Beijing Bechade Opto-Electronic, Co.,Ltd. All rights reserved. */
