/*=============================================================================
** 作者：侯玉鹏
** 日期：2017/10/31
** 版本：V1.0
** 函数名:
** 函数功能：
** 输入参数：
** 输出 ：1  返回值：
          2  改变的全局变量
** 本函数调用的其它函数（版本号）：
** 备注：
** 修改日志： （作者，日期，修改内容及原因）
==============================================================================*/

/*============================ INCLUDES ======================================*/
#include "device_ADC.h"
#include "driver_Voltage.h"

#include "Fc_data_Struct.h"
/*============================ MACROS ========================================*/

/*============================ TYPES =========================================*/

/*============================ GLOBAL VARIABLES ==============================*/
extern FlyControlDataStruct g_FlyControlDataStruct;
/*============================ STATIC VARIABLES ==============================*/
s16 voltage;//单位 1mv
float text;
/*============================ FUNCTION ======================================*/
 /*=============================================================================
 + 实现功能：
 + 调用参数功能：
==============================================================================*/
void Fc_voltage_check()
{
    voltage += 0.1f *(2 *(3300 *Adc_ConvertedValue[0]/4096) - voltage);
    text = voltage*2.272;
    g_FlyControlDataStruct.AppVoltage.V=text;
    if( g_FlyControlDataStruct.AppVoltage.V<= 7.85)
    {
        g_FlyControlDataStruct.AppConfigDataStruct.LedControl=Bat_low;
    }
}





